# DECISION TREE IMPLEMENTATION ON TITANIC DATASET

### Exploring the dataset of passangers in titanic and based on the model, predicting the chances of survival of passenger

#### Importing libraries and loading dataset

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

C:\Users\harsh\Anaconda3\lib\site-packages\pandas\compat\_optional.py:138: UserWarning: Pandas requires version '2.7.0' or newer of 'numexpr' (version '2.6.9' currently installed).
  warnings.warn(msg, UserWarning)
C:\Users\harsh\Anaconda3\lib\site-packages\statsmodels\tools\_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [39]:
titanic = pd.read_csv("titanic.csv")

In [40]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Data cleaning
- removing useless features
- labeling/one hot encoding
- handling mission points

In [41]:
titanic.drop(['PassengerId', 'SibSp', 'Parch', 'Name', 'Ticket', 'Cabin', 'Embarked'], axis=1, inplace=True)

In [42]:
titanic

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [43]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   Fare      891 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

In [44]:
titanic.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [45]:
titanic.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

Handling missing data in the Age column of dataset

In [47]:
titanic.Age = titanic.Age.fillna(titanic.Age.mean())

In [48]:
titanic

     Survived  Pclass     Sex        Age     Fare
0           0       3    male  22.000000   7.2500
1           1       1  female  38.000000  71.2833
2           1       3  female  26.000000   7.9250
3           1       1  female  35.000000  53.1000
4           0       3    male  35.000000   8.0500
..        ...     ...     ...        ...      ...
886         0       2    male  27.000000  13.0000
887         1       1  female  19.000000  30.0000
888         0       3  female  29.699118  23.4500
889         1       1    male  26.000000  30.0000
890         0       3    male  32.000000   7.7500

[891 rows x 5 columns]

In [49]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   Fare      891 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

Labelling the sex column

In [50]:
titanic.Sex = titanic.Sex.map({'male':1, 'female':2})

In [51]:
titanic.sample(10)

     Survived  Pclass  Sex        Age      Fare
91          0       3    1  20.000000    7.8542
614         0       3    1  35.000000    8.0500
35          0       1    1  42.000000   52.0000
159         0       3    1  29.699118   69.5500
255         1       3    2  29.000000   15.2458
575         0       3    1  19.000000   14.5000
809         1       1    2  33.000000   53.1000
149         0       2    1  42.000000   13.0000
61          1       1    2  38.000000   80.0000
306         1       1    2  29.699118  110.8833

### Dividing the columns into input and target

In [66]:
inputs = titanic.iloc[:, 1:]
targets = titanic.iloc[:, 0]

In [67]:
inputs.sample(15)

     Pclass  Sex        Age      Fare
863       3    2  29.699118   69.5500
743       3    1  24.000000   16.1000
120       2    1  21.000000   73.5000
227       3    1  20.500000    7.2500
62        1    1  45.000000   83.4750
732       2    1  29.699118    0.0000
110       1    1  47.000000   52.0000
855       3    2  18.000000    9.3500
542       3    2  11.000000   31.2750
660       1    1  50.000000  133.6500
182       3    1   9.000000   31.3875
496       1    2  54.000000   78.2667
767       3    2  30.500000    7.7500
867       1    1  31.000000   50.4958
805       3    1  31.000000    7.7750

In [68]:
targets.sample(15)

459    0
118    0
419    0
106    1
400    1
697    1
821    1
745    0
219    0
372    0
242    0
831    1
82     1
348    1
95     0
Name: Survived, dtype: int64

## Train test split

In [69]:
from sklearn.model_selection import train_test_split

In [70]:
train_x, test_x, train_y, test_y = train_test_split(inputs, targets, test_size=0.2, random_state=42)

In [71]:
print(train_x.shape)
print(train_y.shape)
print(test_x.shape)
print(test_y.shape)

(712, 4)
(712,)
(179, 4)
(179,)

## Decision tree classification using gini index

In [72]:
from sklearn.tree import DecisionTreeClassifier

In [73]:
dt_gini = DecisionTreeClassifier(criterion='gini')

In [74]:
dt_gini.fit(train_x, train_y)

DecisionTreeClassifier()

In [75]:
pred_y = dt_gini.predict(test_x)

In [76]:
pred_y

array([0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1,
       0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0,
       1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0,
       0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0,
       0, 1, 1], dtype=int64)

In [77]:
test_y

709    1
439    0
840    0
720    1
39     1
      ..
433    0
773    0
25     1
84     1
10     1
Name: Survived, Length: 179, dtype: int64

### calculation of mean squared error and r2 score

In [78]:
from sklearn.metrics import mean_squared_error, r2_score

In [79]:
mean_squared_error(test_y, pred_y)

0.24022346368715083

In [80]:
r2_score(test_y, pred_y)

0.009395109395109347

In [83]:
dt_gini.score(test_x, test_y)

0.7597765363128491

## Decision tree classification using entropy

In [84]:
dt_entropy = DecisionTreeClassifier(criterion='entropy')

In [85]:
dt_entropy.fit(train_x, train_y)

DecisionTreeClassifier(criterion='entropy')

In [87]:
y_pred = dt_entropy.predict(test_x)

In [88]:
y_pred

array([0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1,
       0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0,
       1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0,
       0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0,
       0, 1, 1], dtype=int64)

In [89]:
test_y

709    1
439    0
840    0
720    1
39     1
      ..
433    0
773    0
25     1
84     1
10     1
Name: Survived, Length: 179, dtype: int64

In [90]:
mean_squared_error(test_y, y_pred)

0.24581005586592178

In [91]:
r2_score(test_y, y_pred)

-0.01364221364221363

In [92]:
dt_entropy.score(test_x, test_y)

0.7541899441340782